#12주차 수업내코딩
#1.표의 기준대로 딕셔너리를 생성하여, 입력된 문자열을 암호화 한다.
#암호화한 결과를 변수에 저장하여 복호화 하고 원래 입력 받은 문자열과 같은지 확인하여
#결과가 같은지 아닌지 여부를 출력한다

s = [('A', 'M'), ('a', 'm'),('B', 'N'), ('b', 'n'),('C', 'O'), ('c', 'o'),('D', 'V'),('d', 'v'),('E', 'W'),
     ('e', 'w'),('F', 'X'), ('f', 'x'),('G', 'P'), ('g', 'p'),('H', 'Q'), ('h', 'q'),('I', 'R'), ('i', 'r'),
     ('J', 'S'), ('j', 's'),('K', 'T'), ('k', 't'),('L', 'U'), ('l', 'u'),('M', 'A'),('m', 'a'),('N', 'B'),
     ('n', 'b'),('O', 'C'), ('o', 'c'),('P', 'G'), ('p', 'g'),('Q', 'H'), ('q', 'h'),('R', 'I'), ('r', 'i'),
     ('S', 'D'), ('s', 'd'),('T', 'E'), ('t', 'e'),('U', 'F'), ('u', 'f'),('V', 'L'),('v', 'l'), ('W', 'Y'),
     ('w', 'y'),('X', 'Z'), ('x', 'z'),('Y', 'J'), ('y', 'j'),('Z', 'K'), ('z', 'k')]

pwKeys = {'A':'M', 'a':'m','B':'N','b':'n','C':'O','c':'o','D':'V','d':'v','E':'W',
     'e':'w'),('F':'X'), ('f':'x'),('G':'P'), ('g':'p'),('H':'Q'), ('h':'q'),('I':'R'), ('i':'r'),
     ('J':'S'), ('j':'s'),('K':'T'), ('k':'t'),('L':'U'), ('l':'u'),('M':'A'),('m':'a'),('N':'B'),
     ('n':'b'),('O':'C'),

     #현타와서못하겠음 딕셔너리로 다시 해보려했는데... 
     ('o', 'c'),('P', 'G'), ('p', 'g'),('Q', 'H'), ('q', 'h'),('R', 'I'), ('r', 'i'),
     ('S', 'D'), ('s', 'd'),('T', 'E'), ('t', 'e'),('U', 'F'), ('u', 'f'),('V', 'L'),('v', 'l'), ('W', 'Y'),
     ('w', 'y'),('X', 'Z'), ('x', 'z'),('Y', 'J'), ('y', 'j'),('Z', 'K'), ('z', 'k')]


line = input("암호화할 문자열을 입력하세요")
pwLine = []
solLine = []

for i in range(len(line)):

    for j in range(52):
        if line[i] == s[j][0] :
            pwLine.append(s[j][1])
            break

print("암호화된 문자열:", "".join(pwLine))


for i in range(len(pwLine)):
    for j in range(52):
        if pwLine[i] == s[j][1] :
            solLine.append(s[j][0])
            break               

print("복호화된 문자열:", "".join(solLine))


if line == "".join(solLine) :
    print("원본 문자열: ", line, "복호화된 문자열 :", "".join(solLine), " -> 두 문자열은 일치합니다.")
else :
    print("원본 문자열: ", line, "복호화된 문자열 :", "".join(solLine), " -> 두 문자열은 일치하지 않습니다.")


