// c프로그래밍 과제13
/*아래 표의 형식으로 저장되는 데이터에 대하여 (성명/학번/학년/중간고사/기말고사) 
다음 기능을 지원하는 프로그램을 menudriven 방식으로 작성하시오. 

<메뉴구성>
원하는 명령을 선택하시오.

	1. 데이터 추가
	2. 데이터 삭제
	3. 전체 현황 보기
	4. 데이터 조회
	5. 종료
	
	명령 선택:_
	
 <기능 설명>
1. 데이터 추가 : 한 학생에 대한 정보를 추가하는 과정, 초기 empty list에서 시작, 총
100명까지의 항목을 저장할 수 있도록 구현
2. 데이터 삭제 : 삭제를 원하는 학생을 지정(학번으로 지정)하여 목록에서 삭제, 해당
학번의 내용이 없으면 실패 처리(메시지 출력)
3. 전체 현황 보기 : 전체 목록 출력 및 요약 정보(총인원, 중간고사 평균, 기말고사 평균
등 출력), empty list이면 ‘현재 데이터 없음’ 메시지 출력
4. 데이터 조회 : 지정(학번으로)한 학생의 데이터 내용을 출력, 해당 학번의 내용이 없
으면 실패 처리(메시지 출력)
5. 종료 : 프로그램을 종료함
기타 추가 기능 및 인터페이스 설계는 자유롭게 창의적으로 작성할 것 */

#include <stdio.h>

int main(void){
	
	
	return 0;
} 
